src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатурыПоставщиков/ЦеныНоменклатурыПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатурыПоставщиков</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ЦенаЕдиницыХранения</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>НоменклатураКонтрагента</name>
    <type>
      <types>CatalogRef.НоменклатураКонтрагентов</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныЗакупки/ЦеныЗакупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныЗакупки</name>
  <comment>Фиксированные цены по контрагенту; запись с пустым контрагентом - цена по умолчанию</comment>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>НДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>ВаловаяПрибыль</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/РазрешениеНаРедактированиеДокументов/РазрешениеНаРедактированиеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РазрешениеНаРедактированиеДокументов</name>
  <comment>Разовое разрешение пользователю отредактировать документ в закрытом периоде; гаснет после записи документа</comment>
  <resources>
    <name>КтоРазрешил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРазрешения</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИспользования</name>
    <type>
      <types>DateTime</types>
    </type>
  </resources>
  <resources>
    <name>Разрешено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>РедактируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ДвиженияСвязанныхДокументов/ДвиженияСвязанныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияСвязанныхДокументов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодСтроки</name>
    <type>
      <types>DefinedType.КодСтроки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/InformationRegisters/ИсторияЗаказовПокупателейПоСтатусам/ИсторияЗаказовПокупателейПоСтатусам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаказовПокупателейПоСтатусам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СтатусЗаказаПокупателя</name>
    <type>
      <types>EnumRef.СтатусыЗаказовПокупателя</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбеспечения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляВыпуска</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Индикатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ДенежныеСредстваОрганизаций/ДенежныеСредстваОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредстваОрганизаций</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУчет</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.ПрочиеРасходы</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДвижения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладная</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/CommonModules/РаботаСДокументами/Module.bsl
#Область Заполнение

Процедура ЗаполнитьРеквизитыПоУмолчанию(Объект) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыСеанса.ПараметрыПользователя);
	Реквизиты = Объект.Метаданные().Реквизиты;
	Если Реквизиты.Найти("Менеджер") <> Неопределено Тогда
		Объект.Менеджер = ПараметрыСеанса.ФизическоеЛицо;	
	КонецЕсли;
	Если Реквизиты.Найти("Ответственный") <> Неопределено Тогда
		Объект.Ответственный = ПараметрыСеанса.Пользователь;	
	КонецЕсли;
	Если Реквизиты.Найти("МестоХранения") <> Неопределено Тогда
		Объект.МестоХранения = РегистрыСведений.НастройкиПользователей.СкладПользователя();
		Если Не ЗначениеЗаполнено(Объект.МестоХранения) Тогда 
			Объект.МестоХранения = Константы.ОсновноеМестоХранения.Получить();
		КонецЕсли;
	КонецЕсли;
	Если Реквизиты.Найти("Организация") <> Неопределено Тогда
		Объект.Организация = ПараметрыСеанса.Пользователь.Организация;	
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗаписьВсехРегистров(Движения) Экспорт
	Для Каждого Движение Из Движения Цикл
		Движение.Записывать = Истина;	
	КонецЦикла;	
КонецПроцедуры	

Процедура УстановитьДоговорДляПлатёжногоДокумента(Объект) Экспорт
	Если ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПоставщиками(Объект.ХозяйственнаяОперация) Тогда
		Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Ложь);
	ИначеЕсли ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСПокупателями(Объект.ХозяйственнаяОперация) Тогда
		Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Истина);
	Иначе
		Объект.Договор = Неопределено;
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьЗаголовокФормыДокумента(Форма, Объект, Заголовок = "") Экспорт
    Форма.АвтоЗаголовок = Ложь; 
	МетаданныеДокумента = Объект.Ссылка.Метаданные();
	Заголовок = ?(Заголовок = "", МетаданныеДокумента.Синоним, Заголовок);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Заголовок = Заголовок + ": Nouveau";
	Иначе	
		Заголовок = Заголовок + " №" + Объект.Номер + " от " + Формат(Объект.Дата, "ДЛФ=D") + ": ";
		Если Объект.Проведен Тогда
			Заголовок = Заголовок + "Reporté";
		ИначеЕсли МетаданныеДокумента.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить Тогда
			Заголовок = Заголовок + "Non reporté";
		Иначе
			Заголовок = Заголовок + "Enregistré";
		КонецЕсли;
	КонецЕсли;	
	Форма.Заголовок = Заголовок;
КонецПроцедуры

// Заполняет итоги шапки документа по табличным частям товаров и услуг: Сумма (с НДС),
// СуммаНДС и СуммаБезНДС. При фоновом перепроведении итоги не пересчитываются.
//
// Параметры:
//  ДокОбъект - ДокументОбъект - документ с реквизитами Сумма, СуммаНДС, СуммаБезНДС
//              и табличными частями ТЧТовары (обязательно) и ТЧУслуги (если есть)
//
Процедура ЗаполнитьИтогиДокумента(ДокОбъект) Экспорт
	Если ДокОбъект.ДополнительныеСвойства.Свойство(СвойствоВыполняетсяФоновоеПерепроведение()) Тогда
		Возврат;
	КонецЕсли;
	Сумма = ДокОбъект.ТЧТовары.Итог("СуммаСНДС");
	СуммаНДС = ДокОбъект.ТЧТовары.Итог("СуммаНДС");
	Если ДокОбъект.Метаданные().ТабличныеЧасти.Найти("ТЧУслуги") <> Неопределено Тогда
		Сумма = Сумма + ДокОбъект.ТЧУслуги.Итог("СуммаСНДС");
		СуммаНДС = СуммаНДС + ДокОбъект.ТЧУслуги.Итог("СуммаНДС");
	КонецЕсли;
	ДокОбъект.Сумма = Сумма;
	ДокОбъект.СуммаНДС = СуммаНДС;
	ДокОбъект.СуммаБезНДС = Сумма - СуммаНДС;
КонецПроцедуры

// Заполняет в строках товаров последние цены закупки (прайс поставщиков, затем цена по умолчанию
// регистра ЦеныЗакупки) и продажи (последняя продажа контрагенту документа), а также процент наценки
// цены строки к последней закупочной. Один пакет запросов на табличную часть.
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормыСтруктура - документ с реквизитами Контрагент, Дата и ТЧТовары
//           (колонки формы ЦенаЗакупкиПоследняя, ЦенаПродажиПоследняя и, возможно, ПроцентНаценкиНаЦену).
//  Строка - СтрокаТабличнойЧасти, Структура, Неопределено - заполнить только одну строку.
//
Процедура ЗаполнитьПоследниеЦены(Объект, Строка = Неопределено) Экспорт
	Если Строка = Неопределено Тогда
		Строки = Объект.ТЧТовары;
	Иначе
		Строки = Новый Массив;
		Строки.Добавить(Строка);
	КонецЕсли;
	МасНоменклатура = Новый Массив;
	Для Каждого Стр Из Строки Цикл
		МасНоменклатура.Добавить(Стр.Номенклатура);
	КонецЦикла;
	ДатаЦен = ?(Объект.Ссылка.Пустая(), ТекущаяДатаСеанса(), Объект.Дата);
	ТЗЗакупки = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ДатаЦен, МасНоменклатура);
	ТЗЗакупкиФиксированные = РегистрыСведений.ЦеныЗакупки.ПрайсПоставщика(Справочники.Контрагенты.ПустаяСсылка(),
		МасНоменклатура);
	ТЗПродажи = ПоследниеЦеныПродажКонтрагентуТЗ(Объект.Контрагент, МасНоменклатура, ДатаЦен);
	ЦеныКомплектов = ЦеныЗакупкиКомплектов(МасНоменклатура, ДатаЦен);
	Для Каждого Стр Из Строки Цикл
		ЗаполнитьПоследниеЦеныСтроки(Стр, ТЗЗакупки, ТЗЗакупкиФиксированные, ТЗПродажи, ЦеныКомплектов);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьПоследниеЦеныСтроки(Стр, ТЗЗакупки, ТЗЗакупкиФиксированные, ТЗПродажи, ЦеныКомплектов)
	// Последние цены и наценка одной строки по готовым таблицам цен.
	КолонкаНоменклатура = "Номенклатура";
	СтрЦена = ТЗЗакупки.Найти(Стр.Номенклатура, КолонкаНоменклатура);
	Если СтрЦена = Неопределено Тогда
		СтрЦена = ТЗЗакупкиФиксированные.Найти(Стр.Номенклатура, КолонкаНоменклатура);
	КонецЕсли;
	Стр.ЦенаЗакупкиПоследняя = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена);
	ЦенаКомплекта = ЦеныКомплектов.Получить(Стр.Номенклатура);
	Если ЦенаКомплекта <> Неопределено Тогда
		Стр.ЦенаЗакупкиПоследняя = ЦенаКомплекта;
	КонецЕсли;
	СтрЦена = ТЗПродажи.Найти(Стр.Номенклатура, КолонкаНоменклатура);
	Стр.ЦенаПродажиПоследняя = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена);
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр, "ПроцентНаценкиНаЦену") Тогда
		Стр.ПроцентНаценкиНаЦену = ?(Стр.ЦенаЗакупкиПоследняя = 0, 0, (Стр.Цена - Стр.ЦенаЗакупкиПоследняя)
			/ Стр.ЦенаЗакупкиПоследняя * РаботаСДокументамиКлиентСервер.СтоПроцентов());
	КонецЕсли;
КонецПроцедуры

// Возвращает цены закупки комплектов из перечня номенклатуры суммой по составу: последняя
// закупочная цена каждой составляющей (прайс поставщиков, затем регистр ЦеныЗакупки),
// умноженная на количество в составе. Состав и цены получаются пакетно, без запросов в цикле.
//
// Параметры:
//  МасНоменклатура - Массив - номенклатура строк документа (комплекты и не только).
//  ДатаЦен - Дата - дата, на которую берутся цены.
//
// Возвращаемое значение:
//  Соответствие - ключ - СправочникСсылка.Номенклатура (комплект), значение - Число (цена).
//
Функция ЦеныЗакупкиКомплектов(МасНоменклатура, ДатаЦен) Экспорт
	Результат = Новый Соответствие;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Состав.Ссылка КАК Комплект,
	|	Состав.Номенклатура КАК Номенклатура,
	|	Состав.Количество КАК Количество
	|ИЗ
	|	Справочник.Номенклатура.СоставКомплекта КАК Состав
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	|		ПО Состав.Ссылка = СправочникНоменклатура.Ссылка
	|ГДЕ
	|	Состав.Ссылка В (&МасНоменклатура)
	|	И СправочникНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Комплект)";
	Запрос.УстановитьПараметр("МасНоменклатура", МасНоменклатура);
	ТЗСостав = Запрос.Выполнить().Выгрузить();
	Если ТЗСостав.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	КолонкаНоменклатура = "Номенклатура";
	МасСоставляющие = ТЗСостав.ВыгрузитьКолонку(КолонкаНоменклатура);
	ТЗЦены = РегистрыСведений.ЦеныНоменклатурыПоставщиков.ПоследнийПрайс(ДатаЦен, МасСоставляющие);
	ТЗЦеныФиксированные = РегистрыСведений.ЦеныЗакупки.ПрайсПоставщика(Справочники.Контрагенты.ПустаяСсылка(),
		МасСоставляющие);
	Для Каждого Стр Из ТЗСостав Цикл
		СтрЦена = ТЗЦены.Найти(Стр.Номенклатура, КолонкаНоменклатура);
		Если СтрЦена = Неопределено Тогда
			СтрЦена = ТЗЦеныФиксированные.Найти(Стр.Номенклатура, КолонкаНоменклатура);
		КонецЕсли;
		Цена = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена);
		Накоплено = Результат.Получить(Стр.Комплект);
		Результат.Вставить(Стр.Комплект, ?(Накоплено = Неопределено, 0, Накоплено) + Цена * Стр.Количество);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Последние цены продажи номенклатуры контрагенту по оборотам регистра Продажи до даты.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - покупатель.
//  МасНоменклатура - Массив - номенклатура.
//  ДатаЦен - Дата - верхняя граница периода (не включается).
//
// Возвращаемое значение:
//  ТаблицаЗначений - Номенклатура, Цена.
//
Функция ПоследниеЦеныПродажКонтрагентуТЗ(Контрагент, МасНоменклатура, ДатаЦен)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ПродажиОбороты.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			&ДатаЦен,
	|			Регистратор,
	|			Контрагент = &Контрагент
	|				И Номенклатура В (&Номенклатура)) КАК ПродажиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ПродажиОбороты.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА Продажи.Количество <> 0
	|			ТОГДА Продажи.Выручка / Продажи.Количество
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО ВТ_Периоды.Период = Продажи.Период
	|			И ВТ_Периоды.Номенклатура = Продажи.Номенклатура";
	Запрос.УстановитьПараметр("ДатаЦен", Новый Граница(ДатаЦен, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Номенклатура", МасНоменклатура);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти

#Область Синхронизация

Процедура СинхронизироватьСтатусДокумента(ДокОбъект, ДокОбъектОснование)
	Если ДокОбъект.ПометкаУдаления = ДокОбъектОснование.ПометкаУдаления Тогда
		ДокОбъект.Записать(ДокОбъектОснование.ДополнительныеСвойства.РежимЗаписи);	
	Иначе	
		ДокОбъект.Записать(ДокОбъектОснование.ДополнительныеСвойства.РежимЗаписи);
		ДокОбъект.УстановитьПометкуУдаления(ДокОбъектОснование.ПометкаУдаления);
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти

#Область Проверки

Процедура МожноРедактироватьДокументВФорме(Док, Форма) Экспорт 
	Если Форма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	ЗапрещеноРедактировать = Ложь;
	МожноРедактироватьДокумент(Док, ЗапрещеноРедактировать, Истина);
	Форма.ТолькоПросмотр = ЗапрещеноРедактировать;	
КонецПроцедуры

Процедура МожноРедактироватьДокумент(ДокОбъект, Отказ, ПроверкаВФорме = Ложь) Экспорт
	Если Не ПроверкаВФорме и ДокОбъект.ДополнительныеСвойства.Свойство(РаботаСДокументами.СвойствоВыполняетсяФоновоеПерепроведение()) Тогда Возврат КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	ДатаЗапрета = ПолучитьДатуЗапретаРедактирования(ДокОбъект);
	Если Не ДокОбъект.Ссылка.Пустая() 
		и КонецДня(ДокОбъект.Дата) <= КонецДня(ДатаЗапрета)
		и Не РегистрыСведений.НастройкиПользователей.РедактироватьДокументыВЗакрытомПериоде() Тогда
		Если РегистрыСведений.РазрешениеНаРедактированиеДокументов.ЕстьРазрешение(ДокОбъект.Ссылка) Тогда
			// Разовое разрешение: правка пропускается, после записи разрешение гаснет (подписка на запись)
			Если Не ПроверкаВФорме Тогда
				ДокОбъект.ДополнительныеСвойства.Вставить("ИспользованоРазрешениеНаРедактирование", Истина);
			КонецЕсли;
			Возврат;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Нстр("fr = ""Il est interdit d'éditer un document en période fermée""; ru = 'Запрещено редактировать документ в закрытом периоде'; en = 'It is forbidden to edit a document in a closed period.'; es = 'No se puede editar el documento en el período cerrado'"),,,, Отказ);
	КонецЕсли;		
КонецПроцедуры

Функция ПолучитьДатуЗапретаРедактирования(ДокОбъект)
	ДатаЗапретаРедактирования = Дата(1,1,1);
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(ДокОбъект, "Организация") Тогда
		Организация = ДокОбъект.Организация;
	Иначе
		Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли; 
	ТекПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ПараметрыСеанса.Пользователь.ИдентификаторПользователяИБ);
	МассивРолей = Новый Массив;
	Если Не ТекПользовательИБ = Неопределено Тогда
		Для Каждого Роль Из ТекПользовательИБ.Роли Цикл 
			МассивРолей.Добавить(Роль.Синоним);
		КонецЦикла;
	КонецЕсли; 
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДатыЗапретаРедактирования.ВидЗапрета КАК ВидЗапрета,
	                      |	ДатыЗапретаРедактирования.ЗначениеЗапрета КАК ЗначениеЗапрета,
	                      |	ДатыЗапретаРедактирования.ДатаЗапрета КАК ДатаЗапрета
	                      |ИЗ
	                      |	РегистрСведений.ДатыЗапретаРедактирования КАК ДатыЗапретаРедактирования
	                      |ГДЕ
	                      |	ДатыЗапретаРедактирования.Организация В (&Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	                      |	И ВЫБОР
	                      |			КОГДА ДатыЗапретаРедактирования.ВидЗапрета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыЗапретаРедактирования.ПоПользователю)
	                      |				ТОГДА ДатыЗапретаРедактирования.ЗначениеЗапрета = &Пользователь
	                      |			КОГДА ДатыЗапретаРедактирования.ВидЗапрета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыЗапретаРедактирования.ПоРоли)
	                      |				ТОГДА ДатыЗапретаРедактирования.ЗначениеЗапрета В (&МассивРолей)
	                      |			КОГДА ДатыЗапретаРедактирования.ВидЗапрета = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыЗапретаРедактирования.ПоГруппеПользователей)
	                      |				ТОГДА ДатыЗапретаРедактирования.ЗначениеЗапрета В
	                      |						(ВЫБРАТЬ
	                      |							ГруппыПользователей.Ссылка
	                      |						ИЗ
	                      |							СПравочник.ГруппыПользователей.ТЧСостав КАК ГруппыПользователей
	                      |						ГДЕ
	                      |							ГруппыПользователей.Пользователь = &Пользователь)
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатыЗапретаРедактирования.ДатаЗапрета");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.Пользователь);
	Запрос.УстановитьПараметр("МассивРолей", МассивРолей);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ДатаЗапретаРедактирования = Выборка.ДатаЗапрета;
	КонецЕсли;
	// Автозакрытие периода: складские и торговые документы старше N дней закрыты без ручной даты запрета
	ДнейАвтозакрытия = Константы.АвтозакрытиеПериода.Получить();
	Если ДнейАвтозакрытия > 0 И ДокументПодлежитАвтозакрытию(ДокОбъект) Тогда
		ДатаАвтозакрытия = РаботаСДокументамиКлиентСервер.ДобавитьДень(НачалоДня(ТекущаяДатаСеанса()),
			-ДнейАвтозакрытия);
		ДатаЗапретаРедактирования = Макс(ДатаЗапретаРедактирования, ДатаАвтозакрытия);
	КонецЕсли;
	Возврат ДатаЗапретаРедактирования;
КонецФункции

Функция ДокументПодлежитАвтозакрытию(ДокОбъект)
	// Автозакрытие не касается заказов (они живут дольше периода) и денежных документов (закрываются кассой).
	Исключения = "ЗаказПокупателя, ЗаказПоставщику, ПриходныйКассовыйОрдер, РасходныйКассовыйОрдер,
		|ПоступлениеБезналичныхДенежныхСредств, СписаниеБезналичныхДенежныхСредств";
	Возврат СтрНайти(Исключения, ДокОбъект.Метаданные().Имя) = 0;
КонецФункции

Процедура МожноСоздатьДокументНаОсновании(МетаданныеДокумента, Основание) Экспорт
	Если Не ЗначениеЗаполнено(Основание) Тогда Возврат; КонецЕсли;
	Мас = РаботаСДокументами.ПолучитьДокументыПоИмениПоОснованию(МетаданныеДокумента.Имя, Основание);
	Если Мас.Количество() > 0 Тогда
		ВызватьИсключение(МетаданныеДокумента.ПредставлениеОбъекта + " на основании " + СокрЛП(Основание) + " уже введён");	
	КонецЕсли;	
КонецПроцедуры	

Процедура ПроверкаСоответствияВозвратовРеализации(ДокОбъект, РежимЗаписи, Отказ) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Если ДокОбъект.ДополнительныеСвойства.Свойство(РаботаСДокументами.СвойствоВыполняетсяФоновоеПерепроведение()) Тогда 
		Возврат;
	КонецЕсли;
	Если ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Если ДокОбъект.Ссылка.Пустая() Тогда Возврат; КонецЕсли;
		ДокРеализация = ДокОбъект.Ссылка;
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда  
			ТЧТоварыРеализация = СерииИРазмещение.ОбъединитьТоварыССериями(ДокОбъект,"ТЧТовары");
		Иначе
			ТЧТоварыРеализация = ДокОбъект.ТЧТовары.Выгрузить();
			ТЧТоварыРеализация.ЗаполнитьЗначения(0,"Количество");
		КонецЕсли;
	Иначе 
		ДокРеализация = РаботаСДокументами.ПолучитьДокументРодительПоТипу(Тип("ДокументСсылка.РеализацияТоваровУслуг"), ДокОбъект.Основание);
		ТЧТоварыРеализация = СерииИРазмещение.ОбъединитьТоварыССериями(ДокРеализация,"ТЧТовары");
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧТоварыРеализация.КодСтроки КАК КодСтроки,
	|	ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|	ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|	ТЧТоварыРеализация.Серия КАК Серия,
	|	ТЧТоварыРеализация.Количество КАК Количество
	|ПОМЕСТИТЬ ТЧТоварыРеализация
	|ИЗ
	|	&ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЗ.КодСтроки КАК КодСтроки,
	|	ВЗ.Номенклатура КАК Номенклатура,
	|	ВЗ.Характеристика КАК Характеристика,
	|	ВЗ.Серия КАК Серия,
	|	СУММА(ВЗ.Количество) КАК Количество
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТЧТоварыРеализация.КодСтроки КАК КодСтроки,
	|		ТЧТоварыРеализация.Номенклатура КАК Номенклатура,
	|		ТЧТоварыРеализация.Характеристика КАК Характеристика,
	|		ТЧТоварыРеализация.Серия КАК Серия,
	|		ТЧТоварыРеализация.Количество КАК Количество
	|	ИЗ
	|		ТЧТоварыРеализация КАК ТЧТоварыРеализация
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСвязанныхДокументов.КодСтроки,
	|		ДвиженияСвязанныхДокументов.Номенклатура,
	|		ДвиженияСвязанныхДокументов.Характеристика,
	|		ДвиженияСвязанныхДокументов.Серия,
	|		ДвиженияСвязанныхДокументов.КоличествоОборот
	|	ИЗ
	|		РегистрНакопления.ДвиженияСвязанныхДокументов.Обороты(, , Регистратор, Основание = &ДокРеализация) КАК ДвиженияСвязанныхДокументов
	|	ГДЕ
	|		НЕ ДвиженияСвязанныхДокументов.Регистратор = &Регистратор
	|) КАК ВЗ
	|СГРУППИРОВАТЬ ПО
	|	ВЗ.Характеристика,
	|	ВЗ.КодСтроки,
	|	ВЗ.Номенклатура,
	|	ВЗ.Серия";
	Запрос.УстановитьПараметр("ТЧТоварыРеализация",ТЧТоварыРеализация);
	Запрос.УстановитьПараметр("ДокРеализация",ДокРеализация);
	Запрос.УстановитьПараметр("Регистратор",ДокОбъект.Ссылка);
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	//добавляем текущий документ в итоговую таблицу
	Если (ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ВозвратОтПокупателя")) 
		и РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		ТЗ = СерииИРазмещение.ОбъединитьТоварыССериями(ДокОбъект);
		Для Каждого Стр Из ТЗ Цикл
			МасРезультат = ТЗРезультат.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
			Если МасРезультат.Количество() = 0 Тогда 
				СтрРезультат = ТЗРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(СтрРезультат,Стр);
				СтрРезультат.Количество = - Стр.Количество;
			Иначе 
				СтрРезультат = МасРезультат[0];
				СтрРезультат.Количество = СтрРезультат.Количество - Стр.Количество;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	// Удалим нулевые
	Мас = ТЗРезультат.НайтиСтроки(Новый Структура("Количество", 0));
	Для А = 1 - Мас.Количество() По 0 Цикл
		ТЗРезультат.Удалить(Мас[-А]);	
	КонецЦикла;
	Для Каждого Стр из ТЗРезультат Цикл 
		Если Стр.Количество < 0  Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(""+ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура,Стр.Характеристика,Стр.Серия) 
				+ НСтр("ru = ': количество возвратов превышает количество в реализации '; fr = "": le nombre de retours dépasse le nombre dans la facture"""),,,, Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Представления

Функция СформироватьЦифровойНомер(Знач Номер) Экспорт
	Результат = "";
	Для А = 1 По СтрДлина(Номер) Цикл
		Сим = Сред(Номер, А, 1);
		Если Не ОбщегоНазначенияКлиентСервер.ТолькоЦифрыВСтроке(Сим) Или Сим = "0" Тогда Продолжить КонецЕсли;
		Результат = Сред(Номер, А, СтрДлина(Номер) - (А - 1));
		Прервать;
	КонецЦикла;
	Возврат Результат;
КонецФункции

Функция КраткоеПредставлениеДокумента(Док, Знач Наименование = Неопределено, ДатаДокумента = Неопределено) Экспорт
	Наименование = ?(Наименование = Неопределено, Док.Метаданные().ПредставлениеОбъекта, Наименование);
	Наименование = Наименование + " № " + СформироватьЦифровойНомер(Док.Номер) + " ";
	Если ДатаДокумента = Неопределено Тогда
		Наименование = Наименование + Формат(Док.Дата, "ДЛФ=DD");	
	Иначе
		Наименование = Наименование + Формат(ДатаДокумента, "ДЛФ=DD");	
	КонецЕсли;	
	Возврат Наименование;	
КонецФункции

#КонецОбласти

#Область Поиск

Функция ПолучитьДокументыПоИмениПоОснованию(ИмяДокумента, Основание, НеПомеченныеНаУдаление = Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	СвязанныеДокументы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	КритерийОтбора.СвязанныеДокументы(&Основание) КАК СвязанныеДокументы
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &НеПомеченныенаУдаление
	                      |				ТОГДА СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ
	                      |			ИНАЧЕ ИСТИНА
	                      |		КОНЕЦ
	                      |	И СвязанныеДокументы.Ссылка ССЫЛКА Документ." + ИмяДокумента);	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("НеПомеченныеНаУдаление", НеПомеченныеНаУдаление);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
КонецФункции

Функция ПолучитьДокументРодительПоТипу(ТипРодителя, Знач Основание) Экспорт
	Результат = Неопределено;
	Пока ЗначениеЗаполнено(Основание) Цикл
		Если ТипЗнч(Основание) = ТипРодителя Тогда
			Результат = Основание;
			Прервать;
		КонецЕсли;
		Основание = ?(Основание.Метаданные().Реквизиты.Найти("Основание") = Неопределено, Неопределено, Основание.Основание);
	КонецЦикла;		
	Возврат Результат;	
КонецФункции	

#КонецОбласти

#Область Разное

// Обновляет статус заказа покупателя по документам производственного контура.
//
// Статус определяется последним по дате проведённым документом, связанным с заказом
// (критерий отбора СвязанныеДокументы): реализация - «Отгружен», выпуск продукции -
// «В производстве», передача в переработку - «Передан субподрядчику», поступление из
// переработки - «Получен от субподрядчика». Если проведённых связанных документов не
// осталось, статус возвращается к состоянию заказа («Новый» или «В работе»). Запись в
// регистр ИсторияЗаказовПокупателейПоСтатусам добавляется, только если статус изменился.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ПередачаВПереработку, ДокументОбъект.ПоступлениеИзПереработки,
//              ДокументОбъект.ВыпускПродукции - записываемый документ производственного контура
Процедура ОбновитьПроизводственныйСтатусЗаказа(ДокОбъект) Экспорт
	Заказ = ПолучитьДокументРодительПоТипу(Тип("ДокументСсылка.ЗаказПокупателя"), ДокОбъект.Основание);
	Если ЗначениеЗаполнено(Заказ) Тогда
		ОбновитьСтатусЗаказаПоСвязанным(Заказ);
	КонецЕсли;
КонецПроцедуры

// Пересчитывает статус заказа покупателя по последнему проведённому связанному документу
// и дописывает его в историю статусов, если он изменился (см. ОбновитьПроизводственныйСтатусЗаказа).
//
// Параметры:
//  Заказ - ДокументСсылка.ЗаказПокупателя - заказ, статус которого пересчитывается
Процедура ОбновитьСтатусЗаказаПоСвязанным(Заказ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СвязанныеДокументы.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Связанные
	                      |ИЗ
	                      |	КритерийОтбора.СвязанныеДокументы(&Заказ) КАК СвязанныеДокументы
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Документы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Т.Ссылка КАК Ссылка,
	                      |		Т.Дата КАК Дата
	                      |	ИЗ
	                      |		Документ.РеализацияТоваровУслуг КАК Т
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Связанные КАК Связанные
	                      |			ПО Т.Ссылка = Связанные.Ссылка
	                      |	ГДЕ
	                      |		Т.Проведен
	                      |
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |	ВЫБРАТЬ
	                      |		Т.Ссылка,
	                      |		Т.Дата
	                      |	ИЗ
	                      |		Документ.ВыпускПродукции КАК Т
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Связанные КАК Связанные
	                      |			ПО Т.Ссылка = Связанные.Ссылка
	                      |	ГДЕ
	                      |		Т.Проведен
	                      |
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |	ВЫБРАТЬ
	                      |		Т.Ссылка,
	                      |		Т.Дата
	                      |	ИЗ
	                      |		Документ.ПередачаВПереработку КАК Т
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Связанные КАК Связанные
	                      |			ПО Т.Ссылка = Связанные.Ссылка
	                      |	ГДЕ
	                      |		Т.Проведен
	                      |
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |	ВЫБРАТЬ
	                      |		Т.Ссылка,
	                      |		Т.Дата
	                      |	ИЗ
	                      |		Документ.ПоступлениеИзПереработки КАК Т
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Связанные КАК Связанные
	                      |			ПО Т.Ссылка = Связанные.Ссылка
	                      |	ГДЕ
	                      |		Т.Проведен) КАК Документы
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Документы.Дата УБЫВ");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Статус = Перечисления.СтатусыЗаказовПокупателя.Отгружен;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВыпускПродукции") Тогда
			Статус = Перечисления.СтатусыЗаказовПокупателя.ВПроизводстве;
		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПередачаВПереработку") Тогда
			Статус = Перечисления.СтатусыЗаказовПокупателя.ПереданСубподрядчику;
		Иначе
			Статус = Перечисления.СтатусыЗаказовПокупателя.ПолученОтСубподрядчика;
		КонецЕсли;
	ИначеЕсли Заказ.МенеджерПодтвердилПроверилОстаток Тогда
		Статус = Перечисления.СтатусыЗаказовПокупателя.ВРаботе;
	Иначе
		Статус = Перечисления.СтатусыЗаказовПокупателя.Новый;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СрезПоследних.СтатусЗаказаПокупателя КАК СтатусЗаказаПокупателя
	                      |ИЗ
	                      |	РегистрСведений.ИсторияЗаказовПокупателейПоСтатусам.СрезПоследних(, ЗаказПокупателя = &Заказ) КАК СрезПоследних");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	ВыборкаСтатуса = Запрос.Выполнить().Выбрать();
	Если ВыборкаСтатуса.Следующий() И ВыборкаСтатуса.СтатусЗаказаПокупателя = Статус Тогда
		Возврат;
	КонецЕсли;
	НоваяЗапись = РегистрыСведений.ИсторияЗаказовПокупателейПоСтатусам.СоздатьМенеджерЗаписи();
	НоваяЗапись.Период = ТекущаяДатаСеанса();
	НоваяЗапись.ЗаказПокупателя = Заказ;
	НоваяЗапись.СтатусЗаказаПокупателя = Статус;
	НоваяЗапись.Записать(Ложь);
КонецПроцедуры

// Скрывает на форме документа поля, чей реквизит объекта имеет определяемый тип суммы.
//
// Применяется для пользователей с ролью ОператорПроизводства: оператор работает с составом
// документов, но не видит цен и сумм. Обходятся поля с путём к данным "Объект.<Реквизит>"
// и "Объект.<ТабличнаяЧасть>.<Реквизит>"; поле скрывается, если тип реквизита совпадает с
// типом определяемого типа Сумма или СуммаНеотрицательная.
//
// Параметры:
//  Форма   - ФормаКлиентскогоПриложения - форма документа с основным реквизитом "Объект"
//  ИмяРоли - Строка - имя роли; ограничение применяется, только если роль доступна пользователю
Процедура ОграничитьВидимостьРеквизитовПоТипу(Форма, ИмяРоли) Экспорт
	// BSLLS:IsInRoleMethod-off - ограничение интерфейсное и привязано именно к роли, а не к праву
	Если Не РольДоступна(ИмяРоли) Тогда
		Возврат;
	КонецЕсли;
	// BSLLS:IsInRoleMethod-on
	ТипыСумм = Новый Массив;
	Для Каждого ИмяТипа Из СтрРазделить("Сумма,СуммаНеотрицательная", ",") Цикл
		МетаОпределяемыйТип = Метаданные.ОпределяемыеТипы.Найти(ИмяТипа);
		Если МетаОпределяемыйТип <> Неопределено Тогда
			ТипыСумм.Добавить(МетаОпределяемыйТип.Тип);
		КонецЕсли;
	КонецЦикла;
	МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(Форма.Объект.Ссылка));
	Если МетаданныеДокумента = Неопределено Или ТипыСумм.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого ЭлементФормы Из Форма.Элементы Цикл
		Если ТипЗнч(ЭлементФормы) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
		МетаРеквизит = МетаРеквизитДокументаПоПути(МетаданныеДокумента, ЭлементФормы.ПутьКДанным);
		Если МетаРеквизит <> Неопределено И ЭтоРеквизитСуммы(МетаРеквизит, ТипыСумм) Тогда
			ЭлементФормы.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Параметры:
//  МетаРеквизит - ОбъектМетаданных - реквизит документа или табличной части
//  ТипыСумм     - Массив из ОписаниеТипов - типы определяемых типов сумм
//
// Возвращаемое значение:
//  Булево - Истина, если тип реквизита совпадает с одним из переданных описаний типов
Функция ЭтоРеквизитСуммы(МетаРеквизит, ТипыСумм)
	Для Каждого ТипСуммы Из ТипыСумм Цикл
		Если МетаРеквизит.Тип = ТипСуммы Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

// Возвращает метаданные реквизита документа по пути к данным поля формы.
//
// Параметры:
//  МетаданныеДокумента - ОбъектМетаданных - метаданные документа формы
//  ПутьКДанным         - Строка - путь к данным поля: "Объект.<Реквизит>" или
//                        "Объект.<ТабличнаяЧасть>.<Реквизит>"
//
// Возвращаемое значение:
//  ОбъектМетаданных, Неопределено - реквизит шапки или табличной части; Неопределено,
//  если путь не ведёт к реквизиту объекта
Функция МетаРеквизитДокументаПоПути(МетаданныеДокумента, ПутьКДанным)
	МассивПути = СтрРазделить(ПутьКДанным, ".");
	Если МассивПути[0] <> "Объект" Тогда
		Возврат Неопределено;
	КонецЕсли;
	МассивПути.Удалить(0);
	Если МассивПути.ВГраница() = 0 Тогда
		Возврат МетаданныеДокумента.Реквизиты.Найти(МассивПути[0]);
	КонецЕсли;
	Если МассивПути.ВГраница() = 1 Тогда
		МетаТЧ = МетаданныеДокумента.ТабличныеЧасти.Найти(МассивПути[0]);
		Возврат ?(МетаТЧ = Неопределено, Неопределено, МетаТЧ.Реквизиты.Найти(МассивПути[1]));
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьПоследовательность(Знач ДатаНачала = Неопределено, Знач ДатаОкончания = Неопределено) Экспорт
	Если ДатаНачала = Неопределено Тогда  
		Граница = Последовательности.Основная.ПолучитьГраницу();
		ДатаНачала = Граница.Дата;
	КонецЕсли;
	ДатаОкончания = ?(ДатаОкончания = Неопределено, Дата(1,1,1), КонецДня(ДатаОкончания));
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Основная.Регистратор КАК Документ,
	                      |	Основная.Период КАК Дата
	                      |ИЗ
	                      |	Последовательность.Основная КАК Основная
	                      |ГДЕ
	                      |	Основная.Регистратор.Проведен = ИСТИНА
	                      |	И Основная.Период >= &ДатаНачала
	                      |	И ВЫБОР
	                      |			КОГДА &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	                      |				ТОГДА ИСТИНА
	                      |			ИНАЧЕ Основная.Период <= &ДатаОкончания
	                      |		КОНЕЦ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Основная.МоментВремени");
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Возврат Запрос.Выполнить().Выгрузить();	
КонецФункции

// Перезаполняет цены табличной части по виду цен одним срезом прайса; фиксированные цены покупателя
// и базы динамического расчёта тоже готовятся одним запросом на табличную часть.
//
// Параметры:
//  ТЧТовары - ДанныеФормыКоллекция, ТабличнаяЧасть - строки с реквизитами ВидЦены, Цена, Номенклатура.
//  ВидЦены - СправочникСсылка.ВидыЦен - вид цен для всех строк.
//  ДатаЦен - Дата - дата среза цен.
//  ЦенаВключаетНДС - Булево - режим НДС документа.
//  Контрагент - СправочникСсылка.Контрагенты - покупатель для фиксированных цен (регистр ЦеныПродажи).
//
Процедура УстановитьЦеныВТабличнойЧасти(ТЧТовары, ВидЦены, ДатаЦен, ЦенаВключаетНДС = Истина,
	Контрагент = Неопределено) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	МасВидыЦен = Новый Массив;
	МасВидыЦен.Добавить(ВидЦены);
	ТЗПоследнийПрайс = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ДатаЦен, МасВидыЦен);
	МасНоменклатура = Новый Массив;
	МасХарактеристики = Новый Массив;
	Для Каждого Стр Из ТЧТовары Цикл
		МасНоменклатура.Добавить(Стр.Номенклатура);
		МасХарактеристики.Добавить(Стр.Характеристика);
	КонецЦикла;
	ДанныеЦен = ОбщегоНазначенияВызовСервера.ДанныеЦенДляСписка(Контрагент, Ложь, МасНоменклатура,
		МасХарактеристики, ВидЦены, ДатаЦен);
	Для Каждого Стр Из ТЧТовары Цикл
		Стр.ВидЦены = ВидЦены;
		ОбщегоНазначенияВызовСервера.ПолучитьЦенуНоменклатуры(Стр, ТЗПоследнийПрайс, ЦенаВключаетНДС, ДанныеЦен);
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры	

#КонецОбласти

#Область Задолженность_по_взаиморасчётам

Функция ПараметрыПолученияЗадолженности(ДокОбъект, ПолучатьДолгОрганизации, ВсеНеоплаченные) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДатаСреза", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
	Результат.Вставить("Организация", ДокОбъект.Организация);
	Результат.Вставить("Контрагент", ДокОбъект.Контрагент); 
	Результат.Вставить("Договор", ДокОбъект.Договор);
	Результат.Вставить("ПолучатьДолгОрганизации", ПолучатьДолгОрганизации);
	Результат.Вставить("ВсеНеоплаченные", ВсеНеоплаченные);
	МасВыбранные = Новый Массив;
	Для Каждого Стр Из ДокОбъект.ТЧОснования Цикл
		МасВыбранные.Добавить(Стр.Основание);							
	КонецЦикла;
	Результат.Вставить("ВыбранныеДокументы", МасВыбранные);
	Возврат Результат;
КонецФункции	
	
Функция ПолучитьЗадолженностьДляОплаты(Параметры) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВЫБОР
	                      |		КОГДА ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток < 0
	                      |			ТОГДА -ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток
	                      |		ИНАЧЕ ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток
	                      |	КОНЕЦ КАК Сумма,
	                      |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов.Дата КАК ОбъектРасчётовДата
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
	                      |			&ДатаСреза,
	                      |			Организация = &Организация
	                      |				И (Контрагент = &Контрагент
	                      |					ИЛИ Контрагент.Родитель = &Контрагент)
	                      |				И Договор = &Договор) КАК ВзаиморасчётыСПокупателямиОстатки
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПолучатьДолгОрганизации
	                      |				ТОГДА ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток < 0
	                      |			ИНАЧЕ ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток > 0
	                      |		КОНЕЦ
	                      |	И (ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.РеализацияТоваровУслуг
	                      |			ИЛИ ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.КорректировкаДолга)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов,
	                      |	ВЫБОР
	                      |		КОГДА ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток < 0
	                      |			ТОГДА -ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток
	                      |		ИНАЧЕ ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток
	                      |	КОНЕЦ,
	                      |	ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов.Дата
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
	                      |			&ДатаСреза,
	                      |			Организация = &Организация
	                      |				И (Контрагент = &Контрагент
	                      |					ИЛИ Контрагент.Родитель = &Контрагент)
	                      |				И Договор = &Договор) КАК ВзаиморасчётыСПоставщикамиОстатки
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПолучатьДолгОрганизации
	                      |				ТОГДА ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток < 0
	                      |			ИНАЧЕ ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток > 0
	                      |		КОНЕЦ
	                      |	И (ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.ПоступлениеТоваровУслуг
	                      |			ИЛИ ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.КорректировкаДолга)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОбъектРасчётовДата");
	Запрос.УстановитьПараметр("ДатаСреза", Параметры.ДатаСреза);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Запрос.УстановитьПараметр("Контрагент", Параметры.Контрагент);
	Запрос.УстановитьПараметр("Договор", Параметры.Договор);
	Запрос.УстановитьПараметр("ПолучатьДолгОрганизации", Параметры.ПолучатьДолгОрганизации);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ПолучитьАвансыДляЗакрытия(ДокОбъект, ПолучатьДолгОрганизации, ВсеНеоплаченные) Экспорт
	Контрагент = ДокОбъект.Контрагент;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов КАК ОбъектРасчётов,
	                      |	ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток КАК Сумма,
	                      |	ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов.Дата КАК ОбъектРасчётовДата
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчётыСПокупателями.Остатки(
	                      |			&ДатаСреза,
	                      |			Организация = &Организация
	                      |				И Контрагент = &Контрагент) КАК ВзаиморасчётыСПокупателямиОстатки
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПолучатьДолгОрганизации
	                      |				ТОГДА ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток < 0
	                      |			ИНАЧЕ ВзаиморасчётыСПокупателямиОстатки.СуммаОстаток > 0
	                      |		КОНЕЦ
	                      |	И (ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	                      |			ИЛИ ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	                      |			ИЛИ ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.ПриходныйКассовыйОрдер
	                      |			ИЛИ ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.РасходныйКассовыйОрдер
	                      |			ИЛИ ВзаиморасчётыСПокупателямиОстатки.ОбъектРасчётов ССЫЛКА Документ.КорректировкаДолга)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов,
	                      |	ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток,
	                      |	ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов.Дата
	                      |ИЗ
	                      |	РегистрНакопления.ВзаиморасчётыСПоставщиками.Остатки(
	                      |			&ДатаСреза,
	                      |			Организация = &Организация
	                      |				И Контрагент = &Контрагент) КАК ВзаиморасчётыСПоставщикамиОстатки
	                      |ГДЕ
	                      |	ВЫБОР
	                      |			КОГДА &ПолучатьДолгОрганизации
	                      |				ТОГДА ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток < 0
	                      |			ИНАЧЕ ВзаиморасчётыСПоставщикамиОстатки.СуммаОстаток > 0
	                      |		КОНЕЦ
	                      |	И (ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.ПоступлениеБезналичныхДенежныхСредств
	                      |			ИЛИ ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.СписаниеБезналичныхДенежныхСредств
	                      |			ИЛИ ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.ПриходныйКассовыйОрдер
	                      |			ИЛИ ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.РасходныйКассовыйОрдер
	                      |			ИЛИ ВзаиморасчётыСПоставщикамиОстатки.ОбъектРасчётов ССЫЛКА Документ.КорректировкаДолга)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ОбъектРасчётовДата");
	Запрос.УстановитьПараметр("ДатаСреза", РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(ДокОбъект));
	Запрос.УстановитьПараметр("Организация", ДокОбъект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//Запрос.УстановитьПараметр("Договор", ДокОбъект.Договор);
	Запрос.УстановитьПараметр("ПолучатьДолгОрганизации", ПолучатьДолгОрганизации);
	Выб = Запрос.Выполнить().Выбрать();	
	СуммаОстаток = ДокОбъект.Сумма;
	ДокОбъект.ТЧЗачётАвансов.Очистить();
	Пока Выб.Следующий() Цикл
		Если СуммаОстаток = 0 Тогда Прервать КонецЕсли;
		НС = ДокОбъект.ТЧЗачётАвансов.Добавить();
		НС.Основание = Выб.ОбъектРасчётов;
		НС.Сумма = ВычисленияКлиентСервер.МодульЧисла(Выб.Сумма); 
		Если Не ВсеНеоплаченные Тогда
			Если НС.Сумма > СуммаОстаток Тогда 
				НС.Сумма = СуммаОстаток;
			КонецЕсли;		
			СуммаОстаток = СуммаОстаток - НС.Сумма; 
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьЗадолженностьДляЗакрытия(ДокОбъект, Параметры, ТЗЗадолженность = Неопределено) Экспорт
	Если ТЗЗадолженность = Неопределено Тогда
		ТЗЗадолженность = ПолучитьЗадолженностьДляОплаты(Параметры);
	КонецЕсли;
	СуммаОстаток = ДокОбъект.Сумма;
	Для Каждого Стр Из ТЗЗадолженность Цикл
		Если СуммаОстаток = 0 Тогда Прервать КонецЕсли;
		НС = ДокОбъект.ТЧОснования.Добавить();
		НС.Основание = Стр.ОбъектРасчётов;
		ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(Стр.ОбъектРасчётов);
		ЗаполнитьЗначенияСвойств(НС, ДанныеСуммы);
		Если Параметры.ВсеНеоплаченные Тогда
			НС.Сумма = Стр.Сумма;	
		Иначе	
			НС.Сумма = ?(Стр.Сумма > СуммаОстаток, СуммаОстаток, Стр.Сумма);
			СуммаОстаток = СуммаОстаток - НС.Сумма;
		КонецЕсли;	
		Если НС.Сумма <> ДанныеСуммы.Сумма Тогда
			РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДСПлатёжногоДокумента(НС);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

Функция ПолучитьСрокОплаты(Контрагент, ДатаОтсчета) Экспорт
	СрокОплаты = ДатаОтсчета;
	Если Не ЗначениеЗаполнено(Контрагент) Тогда 
		Возврат СрокОплаты;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Контрагент.УсловияОплаты) Тогда 
		Возврат СрокОплаты;
	КонецЕсли;
	Если Контрагент.УсловияОплаты.ВидУсловия = Перечисления.ВидыУсловияОплаты.КонецМесяцаДатыНакладной Тогда 
		СрокОплаты = КонецМесяца(ДатаОтсчета);
	Иначе
		СрокОплаты = ДатаОтсчета;
	КонецЕсли;
	СрокОплаты = РаботаСДокументамиКлиентСервер.ДобавитьДень(СрокОплаты,Контрагент.УсловияОплаты.КоличествоДней);
	Возврат СрокОплаты;
КонецФункции

Функция ПолучитьСпособОплаты(Док) Экспорт
	СпособОплаты = "";
	Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	// Реквизит ручной корректировки способов оплаты есть только у налоговых накладных;
	// у остальных документов (реализация, счёт) оплаты берутся из движений по деньгам.
	РучнаяКорректировка = Ложь;
	Если Док.Метаданные().Реквизиты.Найти("РучнаяКорректировка") <> Неопределено Тогда
		РучнаяКорректировка = Док.РучнаяКорректировка;
	КонецЕсли;
	Если РучнаяКорректировка Тогда
		ТЗОплат = Док.ТЧСпособыОплаты.Выгрузить();
		ТЗОплат.Свернуть("Период,ТипДенежныхСредств,Чек","Сумма");
	Иначе
		ТЗОплат = РегистрыНакопления.ДенежныеСредстваОрганизаций.ПолучитьОплаты(Док, Истина);
		ТЗОплат.Свернуть("Период,Регистратор,ТипДенежныхСредств,ТипДвижения","Сумма");
	КонецЕсли;
	Для Каждого СТр из ТЗОплат Цикл
		Если ЗначениеЗаполнено(СпособОплаты) Тогда 
			СпособОплаты = СпособОплаты + Символы.ПС;
		КонецЕсли;
		Если Стр.ТипДенежныхСредств = Справочники.TypesDePayment.Cheque Тогда
			Чек = ?(РучнаяКорректировка, Стр.Чек, Стр.Регистратор.Чек);
			ТипДенежныхСредств = "" +Стр.ТипДенежныхСредств + " №" + Чек.Наименование + ", " + Чек.Банк +  " de " + Формат(Чек.ДатаЧека,"ДЛФ=D");
		Иначе
			ТипДенежныхСредств = Стр.ТипДенежныхСредств;
		КонецЕсли;
		Если РучнаяКорректировка Тогда 
			Коэф = 1;
		Иначе
			Коэф = ?(Стр.ТипДвижения = Перечисления.ТипыДвиженияДенежныхСредств.Поступление, 1, -1);
		КонецЕсли;
		СпособОплаты = СпособОплаты + "" + Формат(Стр.Период,"ДЛФ=D") + " - " + ТипДенежныхСредств + ": "+Формат(Коэф*Стр.Сумма,"ЧДЦ=2") + " " +Валюта;
	КонецЦикла;
	Возврат СпособОплаты;
КонецФункции

#КонецОбласти

#Область Тэги

Функция СвойствоЗаписьИзФормы() Экспорт
	Возврат "ЗаписьИзФормы";	
КонецФункции

Функция СвойствоВыполняетсяФоновоеПерепроведение() Экспорт
	Возврат "ВыполняетсяФоновоеПерепроведение";	
КонецФункции

Функция СвойствоОбъектИзменён() Экспорт
	Возврат "ОбъектИзменён";	
КонецФункции

#КонецОбласти

#Область Платёжные_документы

Функция РазвернутьНДСПлатёжногоДокумента(ТЗОснования) Экспорт
	ТЗРезультат = Новый ТаблицаЗначений;
	ТЗРезультат.Колонки.Добавить("КодСтроки", Метаданные.ОпределяемыеТипы.КодСтроки.Тип);
	ТЗРезультат.Колонки.Добавить("Основание");
	ТЗРезультат.Колонки.Добавить("НазначениеПлатежа", Метаданные.ОпределяемыеТипы.Комментарий.Тип);
	ТЗРезультат.Колонки.Добавить("Сумма", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	ТЗРезультат.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("СправочникСсылка.СтавкиНДС"));
	ТЗРезультат.Колонки.Добавить("СуммаНДС", Метаданные.ОпределяемыеТипы.Сумма.Тип);
	Для Каждого Стр Из ТЗОснования Цикл
		Если Стр.НесколькоСтавокНДС Тогда
			МасРасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(Стр.РасшифровкаНДС, Ложь);
			Для Каждого МасСтр Из МасРасшифровкаНДС Цикл
				НС = ТЗРезультат.Добавить();
				ЗаполнитьЗначенияСвойств(НС, Стр,, "Сумма, СтавкаНДС, СуммаНДС");
                НС.Сумма = МасСтр.СуммаСНДС;
				НС.СтавкаНДС = XMLЗначение(Тип("СправочникСсылка.СтавкиНДС"), МасСтр.СтавкаНДС);
				НС.СуммаНДС = МасСтр.СуммаНДС;
				НС.НазначениеПлатежа = СокрЛП(НС.НазначениеПлатежа);
			КонецЦикла;	
		Иначе
			НС = ТЗРезультат.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
			НС.НазначениеПлатежа = СокрЛП(НС.НазначениеПлатежа);
		КонецЕсли;	
	КонецЦикла;
	ТЗРезультат.Свернуть("КодСтроки, Основание, СтавкаНДС, НазначениеПлатежа", "Сумма, СуммаНДС");
	Возврат ТЗРезультат;
КонецФункции

Функция КонвертироватьНДСПлатёжногоДокументаВМассив(ТЗ) Экспорт
	Мас = Новый Массив;
	Для Каждого Стр Из ТЗ Цикл
		Структура = Новый Структура;
		Структура.Вставить("СтавкаНДС", XMLСтрока(Стр.СтавкаНДС));
		Структура.Вставить("СуммаНДС", Стр.СуммаНДС);
		Структура.Вставить("СуммаСНДС", ?(РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Стр, "СуммаСНДС"), Стр.СуммаСНДС, Стр.Сумма));
		Мас.Добавить(Структура);		
	КонецЦикла;
	Возврат Мас;
КонецФункции

Процедура УстановитьВидимостьРеквизитовДенежногоДокумента(Форма) Экспорт
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Элементы.МестоХранения.Видимость = Ложь;
	Если ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыСФизическимиЛицами(Объект.ХозяйственнаяОперация) Тогда
		Элементы.Контрагент.Видимость = Истина;
		//Элементы.Договор.Видимость = Ложь;
		Элементы.Контрагент.Заголовок = Нстр("fr = 'Particulier'; ru = 'Физ. лицо'; en = 'Individual'; es = 'Persona física'");
		РаботаСДокументамиКлиентСервер.УстановитьТипЗначенияПоля(Элементы.Контрагент, Объект.Контрагент, Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
	ИначеЕсли ОбщегоНазначенияВызовСервераПовтИсп.ЭтоРасчётыССобственнымиОрганизациями(Объект.ХозяйственнаяОперация) Тогда
		Элементы.Контрагент.Видимость = Ложь;
		//Элементы.Договор.Видимость = Истина;
		Элементы.Контрагент.Заголовок = Нстр("fr = 'Contreparties'; ru = 'Контрагент'; en = 'Counterparty'; es = 'Contraparte'");
		РаботаСДокументамиКлиентСервер.УстановитьТипЗначенияПоля(Элементы.Контрагент, Объект.Контрагент, Новый ОписаниеТипов("СправочникСсылка.Организации"));	
	Иначе
		Элементы.Контрагент.Видимость = Истина;
		//Элементы.Договор.Видимость = Истина;
		Элементы.Контрагент.Заголовок = Нстр("fr = 'Contreparties'; ru = 'Контрагент'; en = 'Counterparty'; es = 'Contraparte'");
		РаботаСДокументамиКлиентСервер.УстановитьТипЗначенияПоля(Элементы.Контрагент, Объект.Контрагент, Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти  

#Область Касса

Функция НайтиОткрытуюСмену(Касса = Неопределено) Экспорт
	Касса = ?(Касса = Неопределено, РегистрыСведений.НастройкиПользователей.КассаПользователя(),Касса);
	Смена = Документы.КассоваяСмена.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КассоваяСмена.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.КассоваяСмена КАК КассоваяСмена
	|ГДЕ
	|	КассоваяСмена.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
	|	И КассоваяСмена.Касса = &Касса
	|
	|УПОРЯДОЧИТЬ ПО
	|	КассоваяСмена.Дата УБЫВ";
	Запрос.УстановитьПараметр("Касса",Касса);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Смена = Выборка.Ссылка;
	КонецЕсли;
	ВОзврат Смена;
КонецФункции

Функция ПолучитьОстатокВКассе(Касса) Экспорт
	ОстатокВКассе = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДенежныеСредстваОрганизацийОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваОрганизаций.Остатки(
	|			&ВыбДата,
	|			МестоХранения = &МестоХранения
	|				И ТипДенежныхСредств = ЗНАЧЕНИЕ(Справочник.TypesDePayment.Cash)) КАК ДенежныеСредстваОрганизацийОстатки";
	Запрос.УстановитьПараметр("МестоХранения",Касса);
	Запрос.УстановитьПараметр("ВыбДата",ТекущаяДатаСеанса());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ОстатокВКассе = Выборка.СуммаОстаток;
	КонецЕсли;
	Возврат ОстатокВКассе;
КонецФункции

#КонецОбласти
